ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5172.h
/* TAxCCTLx Control Bits */
#define CM1                 (0x8000)  /* Capture mode 1 */
#define CM0                 (0x4000)  /* Capture mode 0 */
#define CCIS1               (0x2000)  /* Capture input select 1 */
#define CCIS0               (0x1000)  /* Capture input select 0 */
#define SCS                 (0x0800)  /* Capture sychronize */
#define SCCI                (0x0400)  /* Latched capture signal (read) */
#define CAP                 (0x0100)  /* Capture mode: 1 /Compare mode : 0 */
#define OUTMOD2             (0x0080)  /* Output mode 2 */
#define OUTMOD1             (0x0040)  /* Output mode 1 */
#define OUTMOD0             (0x0020)  /* Output mode 0 */
#define CCIE                (0x0010)  /* Capture/compare interrupt enable */
#define CCI                 (0x0008)  /* Capture input signal (read) */
#define OUT                 (0x0004)  /* PWM Output signal if output mode 0 */
#define COV                 (0x0002)  /* Capture/compare overflow flag */
#define CCIFG               (0x0001)  /* Capture/compare interrupt flag */

#define OUTMOD_0            (0x0000)  /* PWM output mode: 0 - output only */
#define OUTMOD_1            (0x0020)  /* PWM output mode: 1 - set */
#define OUTMOD_2            (0x0040)  /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3            (0x0060)  /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4            (0x0080)  /* PWM output mode: 4 - toggle */
#define OUTMOD_5            (0x00A0)  /* PWM output mode: 5 - Reset */
#define OUTMOD_6            (0x00C0)  /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7            (0x00E0)  /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0              (0x0000) /* Capture input select: 0 - CCIxA */
#define CCIS_1              (0x1000) /* Capture input select: 1 - CCIxB */
#define CCIS_2              (0x2000) /* Capture input select: 2 - GND */
#define CCIS_3              (0x3000) /* Capture input select: 3 - Vcc */
#define CM_0                (0x0000) /* Capture mode: 0 - disabled */
#define CM_1                (0x4000) /* Capture mode: 1 - pos. edge */
#define CM_2                (0x8000) /* Capture mode: 1 - neg. edge */
#define CM_3                (0xC000) /* Capture mode: 1 - both edges */


/* TAxEX0 Control Bits */
#define TAIDEX0             (0x0001)  /* Timer A Input divider expansion Bit: 0 */
#define TAIDEX1             (0x0002)  /* Timer A Input divider expansion Bit: 1 */
#define TAIDEX2             (0x0004)  /* Timer A Input divider expansion Bit: 2 */

#define TAIDEX_0            (0x0000) /* Timer A Input divider expansion : /1 */
#define TAIDEX_1            (0x0001) /* Timer A Input divider expansion : /2 */
#define TAIDEX_2            (0x0002) /* Timer A Input divider expansion : /3 */
#define TAIDEX_3            (0x0003) /* Timer A Input divider expansion : /4 */
#define TAIDEX_4            (0x0004) /* Timer A Input divider expansion : /5 */
#define TAIDEX_5            (0x0005) /* Timer A Input divider expansion : /6 */
#define TAIDEX_6            (0x0006) /* Timer A Input divider expansion : /7 */
#define TAIDEX_7            (0x0007) /* Timer A Input divider expansion : /8 */

/* T0A3IV Definitions */
#define TA0IV_NONE          (0x0000)    /* No Interrupt pending */
#define TA0IV_TACCR1        (0x0002)    /* TA0CCR1_CCIFG */
#define TA0IV_TACCR2        (0x0004)    /* TA0CCR2_CCIFG */
#define TA0IV_3             (0x0006)    /* Reserved */
#define TA0IV_4             (0x0008)    /* Reserved */
#define TA0IV_5             (0x000A)    /* Reserved */
#define TA0IV_6             (0x000C)    /* Reserved */
#define TA0IV_TAIFG         (0x000E)    /* TA0IFG */

/* Legacy Defines */
#define TA0IV_TA0CCR1       (0x0002)    /* TA0CCR1_CCIFG */
#define TA0IV_TA0CCR2       (0x0004)    /* TA0CCR2_CCIFG */
#define TA0IV_TA0IFG        (0x000E)    /* TA0IFG */

/************************************************************
* Timer0_D3
************************************************************/
#define __MSP430_HAS_T0D3__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T0D3__ 0x0B00
#define TIMER_D0_BASE __MSP430_BASEADDRESS_T0D3__

#define TD0CTL0_              0x0B00    /* Timer0_D3 Control 0 */
sfrw(TD0CTL0, TD0CTL0_);
#define TD0CTL1_              0x0B02    /* Timer0_D3 Control 1 */
sfrw(TD0CTL1, TD0CTL1_);
#define TD0CTL2_              0x0B04    /* Timer0_D3 Control 2 */
sfrw(TD0CTL2, TD0CTL2_);
#define TD0R_                 0x0B06    /* Timer0_D3 Counter */
sfrw(TD0R, TD0R_);
#define TD0CCTL0_             0x0B08    /* Timer0_D3 Capture/Compare Control 0 */
sfrw(TD0CCTL0, TD0CCTL0_);
#define TD0CCR0_              0x0B0A    /* Timer0_D3 Capture/Compare 0 */
sfrw(TD0CCR0, TD0CCR0_);
#define TD0CL0_               0x0B0C    /* Timer0_D3 Capture/Compare Latch 0 */
sfrw(TD0CL0, TD0CL0_);
#define TD0CCTL1_             0x0B0E    /* Timer0_D3 Capture/Compare Control 1 */
sfrw(TD0CCTL1, TD0CCTL1_);
#define TD0CCR1_              0x0B10    /* Timer0_D3 Capture/Compare 1 */
sfrw(TD0CCR1, TD0CCR1_);
#define TD0CL1_               0x0B12    /* Timer0_D3 Capture/Compare Latch 1 */
sfrw(TD0CL1, TD0CL1_);
#define TD0CCTL2_             0x0B14    /* Timer0_D3 Capture/Compare Control 2 */
sfrw(TD0CCTL2, TD0CCTL2_);
#define TD0CCR2_              0x0B16    /* Timer0_D3 Capture/Compare 2 */
sfrw(TD0CCR2, TD0CCR2_);
#define TD0CL2_               0x0B18    /* Timer0_D3 Capture/Compare Latch 2 */
sfrw(TD0CL2, TD0CL2_);
#define TD0HCTL0_             0x0B38    /* Timer0_D3 High-resolution Control Register 0 */
sfrw(TD0HCTL0, TD0HCTL0_);
#define TD0HCTL1_             0x0B3A    /* Timer0_D3 High-resolution Control Register 1 */
sfrw(TD0HCTL1, TD0HCTL1_);
#define TD0HINT_              0x0B3C    /* Timer0_D3 High-resolution Interrupt Register */
sfrw(TD0HINT, TD0HINT_);
#define TD0IV_                0x0B3E    /* Timer0_D3 Interrupt Vector Word */
sfrw(TD0IV, TD0IV_);


/* TDxCTL0 Control Bits */
#define TDCLGRP1            (0x4000)  /* Timer0_D3 Compare latch load group 1 */
#define TDCLGRP0            (0x2000)  /* Timer0_D3 Compare latch load group 0 */
#define CNTL1               (0x1000)  /* Counter lenght 1 */
#define CNTL0               (0x0800)  /* Counter lenght 0 */
#define TDSSEL1             (0x0200)  /* Clock source 1 */
#define TDSSEL0             (0x0100)  /* Clock source 0 */
#define TDCLR               (0x0004)  /* Timer0_D3 counter clear */
#define TDIE                (0x0002)  /* Timer0_D3 interrupt enable */
#define TDIFG               (0x0001)  /* Timer0_D3 interrupt flag */

#define SHR1                (0x4000)  /* Timer0_D3 Compare latch load group 1 */
#define SHR0                (0x2000)  /* Timer0_D3 Compare latch load group 0 */

