ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5172.h
#define TDSSEL_0            (0x0000)  /* Clock Source: TDCLK */
#define TDSSEL_1            (0x0100)  /* Clock Source: ACLK  */
#define TDSSEL_2            (0x0200)  /* Clock Source: SMCLK */
#define TDSSEL_3            (0x0300)  /* Clock Source: INCLK */
#define CNTL_0              (0x0000)  /* Counter lenght: 16 bit */
#define CNTL_1              (0x0800)  /* Counter lenght: 12 bit */
#define CNTL_2              (0x1000)  /* Counter lenght: 10 bit */
#define CNTL_3              (0x1800)  /* Counter lenght:  8 bit */
#define SHR_0               (0x0000)  /* Timer0_D3 Group: 0 - individually */
#define SHR_1               (0x2000)  /* Timer0_D3 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2               (0x4000)  /* Timer0_D3 Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3               (0x6000)  /* Timer0_D3 Group: 3 - 1 group (all) */
#define TDCLGRP_0           (0x0000)  /* Timer0_D3 Group: 0 - individually */
#define TDCLGRP_1           (0x2000)  /* Timer0_D3 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TDCLGRP_2           (0x4000)  /* Timer0_D3 Group: 2 - 2 groups (1-3, 4-6)*/
#define TDCLGRP_3           (0x6000)  /* Timer0_D3 Group: 3 - 1 group (all) */
#define TDSSEL__TACLK       (0x0000)  /* Timer0_D3 clock source select: 0 - TACLK */
#define TDSSEL__ACLK        (0x0100)  /* Timer0_D3 clock source select: 1 - ACLK  */
#define TDSSEL__SMCLK       (0x0200)  /* Timer0_D3 clock source select: 2 - SMCLK */
#define TDSSEL__INCLK       (0x0300)  /* Timer0_D3 clock source select: 3 - INCLK */
#define CNTL__16            (0x0000)  /* Counter lenght: 16 bit */
#define CNTL__12            (0x0800)  /* Counter lenght: 12 bit */
#define CNTL__10            (0x1000)  /* Counter lenght: 10 bit */
#define CNTL__8             (0x1800)  /* Counter lenght:  8 bit */

/* Additional Timer B Control Register bits are defined in Timer A */

/* TDxCTL1 Control Bits */
#define TDCLKM0             (0x0001)   /* Timer0_D3 Clocking Mode Bit: 0 */
#define TDCLKM1             (0x0002)   /* Timer0_D3 Clocking Mode Bit: 1 */
#define TD2CMB              (0x0010)   /* Timer0_D3 TD0CCR Combination in TD2 */
#define TD4CMB              (0x0020)   /* Timer0_D3 TD0CCR Combination in TD4 */
#define TD6CMB              (0x0040)   /* Timer0_D3 TD0CCR Combination in TD6 */
#define TDIDEX0             (0x0100)   /* Timer0_D3 Input divider expansion Bit: 0 */
#define TDIDEX1             (0x0200)   /* Timer0_D3 Input divider expansion Bit: 1 */
#define TDIDEX2             (0x0400)   /* Timer0_D3 Input divider expansion Bit: 2 */

#define TDCLKM_0            (0x0000)   /* Timer0_D3 Clocking Mode: External */
#define TDCLKM_1            (0x0001)   /* Timer0_D3 Clocking Mode: High-Res. local clock */
#define TDCLKM_2            (0x0002)   /* Timer0_D3 Clocking Mode: Aux Clock */
#define TDCLKM__EXT         (0x0000)   /* Timer0_D3 Clocking Mode: External */
#define TDCLKM__HIGHRES     (0x0001)   /* Timer0_D3 Clocking Mode: High-Res. local clock */
#define TDCLKM__AUX         (0x0002)   /* Timer0_D3 Clocking Mode: Aux Clock */

#define TDIDEX_0            (0x0000) /* Timer0_D3 Input divider expansion : /1 */
#define TDIDEX_1            (0x0100) /* Timer0_D3 Input divider expansion : /2 */
#define TDIDEX_2            (0x0200) /* Timer0_D3 Input divider expansion : /3 */
#define TDIDEX_3            (0x0300) /* Timer0_D3 Input divider expansion : /4 */
#define TDIDEX_4            (0x0400) /* Timer0_D3 Input divider expansion : /5 */
#define TDIDEX_5            (0x0500) /* Timer0_D3 Input divider expansion : /6 */
#define TDIDEX_6            (0x0600) /* Timer0_D3 Input divider expansion : /7 */
#define TDIDEX_7            (0x0700) /* Timer0_D3 Input divider expansion : /8 */
#define TDIDEX__1           (0x0000) /* Timer0_D3 Input divider expansion : /1 */
#define TDIDEX__2           (0x0100) /* Timer0_D3 Input divider expansion : /2 */
#define TDIDEX__3           (0x0200) /* Timer0_D3 Input divider expansion : /3 */
#define TDIDEX__4           (0x0300) /* Timer0_D3 Input divider expansion : /4 */
#define TDIDEX__5           (0x0400) /* Timer0_D3 Input divider expansion : /5 */
#define TDIDEX__6           (0x0500) /* Timer0_D3 Input divider expansion : /6 */
#define TDIDEX__7           (0x0600) /* Timer0_D3 Input divider expansion : /7 */
#define TDIDEX__8           (0x0700) /* Timer0_D3 Input divider expansion : /8 */

/* TDxCTL2 Control Bits */
#define TDCAPM0             (0x0001)   /* Timer0_D3 Capture Mode of Channel 0 */
#define TDCAPM1             (0x0002)   /* Timer0_D3 Capture Mode of Channel 1 */
#define TDCAPM2             (0x0004)   /* Timer0_D3 Capture Mode of Channel 2 */
#define TDCAPM3             (0x0008)   /* Timer0_D3 Capture Mode of Channel 3 */
#define TDCAPM4             (0x0010)   /* Timer0_D3 Capture Mode of Channel 4 */
#define TDCAPM5             (0x0020)   /* Timer0_D3 Capture Mode of Channel 5 */
#define TDCAPM6             (0x0040)   /* Timer0_D3 Capture Mode of Channel 6 */

/* TDxCCTLx Control Bits */
#define CLLD1               (0x0400)  /* Compare latch load source 1 */
#define CLLD0               (0x0200)  /* Compare latch load source 0 */

#define SLSHR1              (0x0400)  /* Compare latch load source 1 */
#define SLSHR0              (0x0200)  /* Compare latch load source 0 */

#define SLSHR_0             (0x0000) /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1             (0x0200) /* Compare latch load sourec : 1 - TDR counts to 0 */
#define SLSHR_2             (0x0400) /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3             (0x0600) /* Compare latch load sourec : 3 - TDR counts to TDCTL0 */

#define CLLD_0              (0x0000) /* Compare latch load sourec : 0 - immediate */
#define CLLD_1              (0x0200) /* Compare latch load sourec : 1 - TDR counts to 0 */
#define CLLD_2              (0x0400) /* Compare latch load sourec : 2 - up/down */
#define CLLD_3              (0x0600) /* Compare latch load sourec : 3 - TDR counts to TDCTL0 */

/* TDxHCTL0 Control Bits */
#define TDHEN               (0x0001)   /* Timer0_D3 High-Resolution Enable */
#define TDHREGEN            (0x0002)   /* Timer0_D3 High-Resolution Regulated Mode */
#define TDHEAEN             (0x0004)   /* Timer0_D3 High-Resolution clock error accum. enable */
#define TDHRON              (0x0008)   /* Timer0_D3 High-Resolution Generator forced on*/
#define TDHM0               (0x0010)   /* Timer0_D3 High-Resoltuion Clock Mult. Bit: 0 */
#define TDHM1               (0x0020)   /* Timer0_D3 High-Resoltuion Clock Mult. Bit: 1 */
#define TDHD0               (0x0040)   /* Timer0_D3 High-Resolution clock divider Bit: 0 */
#define TDHD1               (0x0080)   /* Timer0_D3 High-Resolution clock divider Bit: 1 */
#define TDHFW               (0x0100)   /* Timer0_D7 High-resolution generator fast wakeup enable */

#define TDHCALEN            TDHREGEN   /* Timer0_D3 Lagacy Definition */


#define TDHM_0              (0x0000)   /* Timer0_D3 High-Resoltuion Clock Mult.: 8x TimerD clock */
#define TDHM_1              (0x0010)   /* Timer0_D3 High-Resoltuion Clock Mult.: 16x TimerD clock */
#define TDHM__8             (0x0000)   /* Timer0_D3 High-Resoltuion Clock Mult.: 8x TimerD clock */
#define TDHM__16            (0x0010)   /* Timer0_D3 High-Resoltuion Clock Mult.: 16x TimerD clock */
#define TDHD_0              (0x0000)   /* Timer0_D3 High-Resolution clock divider: /1 */
#define TDHD_1              (0x0040)   /* Timer0_D3 High-Resolution clock divider: /2 */
#define TDHD_2              (0x0080)   /* Timer0_D3 High-Resolution clock divider: /4 */
#define TDHD_3              (0x00C0)   /* Timer0_D3 High-Resolution clock divider: /8 */
#define TDHD__1             (0x0000)   /* Timer0_D3 High-Resolution clock divider: /1 */
#define TDHD__2             (0x0040)   /* Timer0_D3 High-Resolution clock divider: /2 */
#define TDHD__4             (0x0080)   /* Timer0_D3 High-Resolution clock divider: /4 */
#define TDHD__8             (0x00C0)   /* Timer0_D3 High-Resolution clock divider: /8 */

/* TDxHCTL1 Control Bits */
#define TDHCLKTRIM0         (0x0002)   /* Timer0_D3 High-Resolution Clock Trim Bit: 0 */
#define TDHCLKTRIM1         (0x0004)   /* Timer0_D3 High-Resolution Clock Trim Bit: 1 */
#define TDHCLKTRIM2         (0x0008)   /* Timer0_D3 High-Resolution Clock Trim Bit: 2 */
#define TDHCLKTRIM3         (0x0010)   /* Timer0_D3 High-Resolution Clock Trim Bit: 3 */
#define TDHCLKTRIM4         (0x0020)   /* Timer0_D3 High-Resolution Clock Trim Bit: 4 */
#define TDHCLKTRIM5         (0x0040)   /* Timer0_D3 High-Resolution Clock Trim Bit: 5 */
#define TDHCLKTRIM6         (0x0080)   /* Timer0_D3 High-Resolution Clock Trim Bit: 6 */
#define TDHCLKSR0           (0x0100)   /* Timer0_D3 High-Resolution Clock Sub-Range Bit: 0 */
#define TDHCLKSR1           (0x0200)   /* Timer0_D3 High-Resolution Clock Sub-Range Bit: 1 */
#define TDHCLKSR2           (0x0400)   /* Timer0_D3 High-Resolution Clock Sub-Range Bit: 2 */
#define TDHCLKSR3           (0x0800)   /* Timer0_D3 High-Resolution Clock Sub-Range Bit: 3 */
#define TDHCLKSR4           (0x1000)   /* Timer0_D3 High-Resolution Clock Sub-Range Bit: 4 */
#define TDHCLKR0            (0x2000)   /* Timer0_D3 High-Resolution Clock Range Bit: 0 */
#define TDHCLKR1            (0x4000)   /* Timer0_D3 High-Resolution Clock Range Bit: 1 */
#define TDHCLKCR            (0x8000)   /* Timer0_D3 High-Resolution Coarse Clock Range */

